In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

## groupby

In [2]:
df = sns.load_dataset("planets")

In [3]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [6]:
df.size

6210

In [7]:
df.shape

(1035, 6)

In [8]:
df.ndim

2

In [10]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

- value_counts()

In [12]:
df["method"].value_counts()  # hangi index değerinden kaç tane var.

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [14]:
df.head(2)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

df.groupby(gruplanacak sütun)[[index]].atribute

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``

In [19]:
df.groupby("method")[["distance", "mass"]].mean()

                                  distance      mass
method
Astrometry                       17.875000       NaN
Eclipse Timing Variations       315.360000  5.125000
Imaging                          67.715937       NaN
Microlensing                   4144.000000       NaN
Orbital Brightness Modulation  1180.000000       NaN
Pulsar Timing                  1200.000000       NaN
Pulsation Timing Variations            NaN       NaN
Radial Velocity                  51.600208  2.630699
Transit                         599.298080  1.470000
Transit Timing Variations      1104.333333       NaN

In [20]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [29]:
df.groupby("method")[["year"]].

                                  year
method
Astrometry                        4023
Eclipse Timing Variations        18090
Imaging                          76347
Microlensing                     46225
Orbital Brightness Modulation     6035
Pulsar Timing                     9992
Pulsation Timing Variations       2007
Radial Velocity                1110158
Transit                         798461
Transit Timing Variations         8050

In [30]:
df2 = sns.load_dataset("tips")

In [31]:
df2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [42]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz'],
                    'col4':['AbC','dh','Dh','ASD']})
df2.head()

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

In [44]:
df2.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [45]:
df2.index

RangeIndex(start=0, stop=4, step=1)

### Sort

In [46]:
df2

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

In [55]:
df2.sort_values(["col1"],0,True)

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

## map

In [65]:
data = {'Company':['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FACE', 'FACE'],
       'Person':['PB', 'Chandler', 'Ross', 'Joey', 'Rachel', 'Monica'],
       'Sales':[100, 140, 150, 99, 102, 110]}

In [66]:
df=pd.DataFrame(data)
df

     Company    Person  Sales
0     GOOGLE        PB    100
1     GOOGLE  Chandler    140
2  MICROSOFT      Ross    150
3  MICROSOFT      Joey     99
4       FACE    Rachel    102
5       FACE    Monica    110

In [67]:
df_m = df.copy()

In [68]:
df_m

     Company    Person  Sales
0     GOOGLE        PB    100
1     GOOGLE  Chandler    140
2  MICROSOFT      Ross    150
3  MICROSOFT      Joey     99
4       FACE    Rachel    102
5       FACE    Monica    110

In [69]:
sözlük = {'GOOGLE':'GOO','MICROSOFT':'MIC','FACE':'FB'}

In [72]:
df_m.Company = df_m.Company.map(sözlük)

In [74]:
df_m

  Company    Person  Sales
0     GOO        PB    100
1     GOO  Chandler    140
2     MIC      Ross    150
3     MIC      Joey     99
4      FB    Rachel    102
5      FB    Monica    110

In [76]:
df_m["sales2"] = df_m.Sales.map(lambda x: x*2)

In [77]:
df_m

  Company    Person  Sales  sales2
0     GOO        PB    100     200
1     GOO  Chandler    140     280
2     MIC      Ross    150     300
3     MIC      Joey     99     198
4      FB    Rachel    102     204
5      FB    Monica    110     220

## replace

In [78]:
df_m

  Company    Person  Sales  sales2
0     GOO        PB    100     200
1     GOO  Chandler    140     280
2     MIC      Ross    150     300
3     MIC      Joey     99     198
4      FB    Rachel    102     204
5      FB    Monica    110     220

In [79]:
df_m["Company"].replace(to_replace="GOO", value="google")

0    google
1    google
2       MIC
3       MIC
4        FB
5        FB
Name: Company, dtype: object

In [80]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df6

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.pivot_table()`

In [82]:
df6

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [86]:
df6.groupby("groups").agg([min, np.median, max])

       var1             var2
        min median  max  min median  max
groups
A        10     30   50  100    300  500
B        20     36   52  200    350  500
C        30     65  100  300    500  700

In [87]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df7

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [91]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [93]:
df7.groupby("groups").std()

             var1        var2
groups
A       28.284271  282.842712
B       22.627417  212.132034
C       49.497475  282.842712

In [97]:
def filter_1 (x):
    return x["var1"].std() < 29

In [100]:
df7.groupby("groups").filter(filter_1)

  groups  var1  var2
0      A    10   100
1      B    20   200
3      A    50   500
4      B    52   500

In [101]:
df7

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

.transform()

In [102]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df8

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [108]:
df8.groupby("groups")[["var1","var2"]].mean()

        var1  var2
groups
A         30   300
B         36   350
C         65   500

In [104]:
df8.groupby("groups").transform("mean")

   var1  var2
0    30   300
1    36   350
2    65   500
3    30   300
4    36   350
5    65   500

In [109]:
df8

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [110]:
df8.apply(np.sum)

groups    ABCABC
var1         262
var2        2300
dtype: object

In [111]:
df8.var1.apply(np.median)

0     10.0
1     20.0
2     30.0
3     50.0
4     52.0
5    100.0
Name: var1, dtype: float64

## pivot table

In [112]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [119]:
titanic.groupby(["sex", "class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [125]:
titanic.groupby(["sex", "class"])[["survived"]].agg("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [128]:
titanic.pivot_table("survived", index="sex", columns ="class" )

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## missing values

In [158]:
dict_2 = {'A':[4, 6, np.nan],'B':[8, np.nan, np.nan],'C':[1, 2, 3]}

In [159]:
df = pd.DataFrame(dict_2)

In [132]:
df

     A    B  C
0  4.0  8.0  1
1  6.0  NaN  2
2  NaN  NaN  3

In [133]:
df.dropna()

     A    B  C
0  4.0  8.0  1

In [156]:
df=df.dropna(axis=1)

In [157]:
df

   C
0  1
1  2
2  3

In [160]:
df

     A    B  C
0  4.0  8.0  1
1  6.0  NaN  2
2  NaN  NaN  3

In [164]:
df["A"].sum()

10.0

In [165]:
df.fillna(value=df["A"].sum())

      A     B  C
0   4.0   8.0  1
1   6.0  10.0  2
2  10.0  10.0  3

In [166]:
V1 = np.array([2,4,6,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,11,8,5,10,6,np.NaN,4,20])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}        
)

df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   4.0   NaN  11.0
2   6.0   5.0   8.0
3   NaN   8.0   5.0
4   7.0  11.0  10.0
5   1.0   NaN   6.0
6   NaN   NaN   NaN
7  10.0   2.0   4.0
8  14.0   3.0  20.0

In [169]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [170]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [171]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   4.0   NaN  11.0
2   6.0   5.0   8.0
3   NaN   8.0   5.0
4   7.0  11.0  10.0
5   1.0   NaN   6.0
6   NaN   NaN   NaN
7  10.0   2.0   4.0
8  14.0   3.0  20.0

In [178]:
df[(df["Var1"].isnull())|(df["Var2"].isnull())]

   Var1  Var2  Var3
1   4.0   NaN  11.0
3   NaN   8.0   5.0
5   1.0   NaN   6.0
6   NaN   NaN   NaN